---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FreeFormElement
source: html/90167238-e6bd-b847-23e8-bce99f620e9b.htm
---
# FreeFormElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.